<?php

return [

    'array' => [],
    /*
    |--------------------------------------------------------------------------
    | 是或否
    |--------------------------------------------------------------------------
    */
    'yesorno' => array(
        '1' => '是',
        '0' => '不是',
    ),

    /*
    |--------------------------------------------------------------------------
    | 狀態
    |--------------------------------------------------------------------------
    */
    'active' => array(
        '1' => '啟用',
        '0' => '停用',
    ),

    /*
    |--------------------------------------------------------------------------
    | 是否上傳班別**
    |--------------------------------------------------------------------------
    */
    'upload1' => array(
        'Y' => '已開班',
        'N' => '未開班',
    ),

    /*
    |--------------------------------------------------------------------------
    | 網頁公告**
    |--------------------------------------------------------------------------
    */
    'publish' => array(
        'Y' => '是',
        'N' => '否',
    ),





    /*
    |--------------------------------------------------------------------------
    | 學員請假處理表單-假別
    |--------------------------------------------------------------------------
    */
    'leave_type' => array(
        '1' => '事假',
        '2' => '病假',
        '3' => '喪假',
        '4' => '請假',
        '5' => '缺課',
    ),
    /*
    |--------------------------------------------------------------------------
    | 早餐及住宿名單處理-選項
    |--------------------------------------------------------------------------
    */
    'stay_list_type' => array(
        '1' => '早餐及住宿',
        '2' => '早餐',
        '3' => '住宿',
    ),
    /*
    |--------------------------------------------------------------------------
    | 機關資料-統計與否
    |--------------------------------------------------------------------------
    */
    'institution_is_statistics' => array(
        '1' => '統計',
        '0' => '不統計',
    ),


    /*
    |--------------------------------------------------------------------------
    | 個人帳號-官職等
    |--------------------------------------------------------------------------
    */
    'recommend_officium' => array(
        '01' => '委任第一職等',
        '02' => '委任第二職等',
        '03' => '委任第三職等',
        '04' => '委任第四職等',
        '05' => '委任第五職等',
        '06' => '薦任第六職等',
        '07' => '薦任第七職等',
        '08' => '薦任第八職等',
        '09' => '薦任第九職等',
        '10' => '簡任第十職等',
        '11' => '簡任第十一職等',
        '12' => '簡任第十二職等',
        '13' => '簡任第十三職等',
        '14' => '簡任第十四職等',
        '15' => '特任',
        '16' => '依法任派人員',
        '17' => '聘雇人員',
        '18' => '約僱人員',
        '19' => '軍職人員',
        '20' => '其他',
    ),


    /*
    |--------------------------------------------------------------------------
    | 教學方法處理 107以後
    |--------------------------------------------------------------------------
    */
    'method_method_new' => array(
        'M01' => '案例研討法',
        'M02' => '(小組)討論教學法',
        'M03' => '視聽教學法',
        'M04' => '模擬演練法',
        'M05' => '體驗學習法',
        'M06' => '個案教學法',
        'M07' => '問題導向學習法',
        'M08' => '微型教學法',
        'M09' => '政經兵棋推演',
        'M10' => '世界咖啡館',
        'M11' => '團隊定向',
        'M12' => '籃中演練法',
        'M13' => '行動學習法',
        'M14' => '探究教學法',
        'M15' => '協同教學法',
        'M16' => '政策論辨法',
        'M17' => '多元文化教學法',
        'M18' => '示範教學法',
    ),

    /*
    |--------------------------------------------------------------------------
    | 教學方法處理 107以前
    |--------------------------------------------------------------------------
    */
    'method_method_old' => array(
        'M01' => '分組討論/對話法',
        'M02' => '問題導向學習法',
        'M03' => '個案教學法',
        'M04' => '視聽教學法',
        'M05' => '示範演練法',
        'M06' => '情境模擬法',
        'M07' => '體驗學習法',
        'M08' => '行動學習法',
        'M09' => '微型教學法',
        'M10' => '協同教學法',
        'M11' => '跨領域教學法',
    ),

    /*
    |--------------------------------------------------------------------------
    | 講座聘任-類型
    |--------------------------------------------------------------------------
    */
    'site_survey_dept' => array(
        '1' => '政府機關學校或公營事業機構',
        '2' => '民營企業或私立學校',
        '3' => '非營利機構',
        '4' => '其他',
    ),



    /*
    |--------------------------------------------------------------------------
    | 講座聘任-類型
    |--------------------------------------------------------------------------
    */
    'employ_type' => array(
        '1' => '講座',
        '2' => '助理',
    ),



    /*
    |--------------------------------------------------------------------------
    | 講座資料維護-轉帳帳戶
    |--------------------------------------------------------------------------
    */
    'lecture_transfor' => array(
        '1' => '郵局',
        '2' => '金融機構',
    ),

    /*
    |--------------------------------------------------------------------------
    | 講座資料維護-分類
    |--------------------------------------------------------------------------
    */
    'lecture_kind' => array(
        '1' => '外聘',
        '2' => '總處',
        '3' => '內聘',
        '4' => '其他',
    ),

    /*
    |--------------------------------------------------------------------------
    | 講座資料維護-郵寄
    |--------------------------------------------------------------------------
    */
    'lecture_send' => array(
        '1' => '機關',
        '2' => '住家',
        '3' => '戶籍地',
    ),

    /*
    |--------------------------------------------------------------------------
    | 講座擬聘處理-證號別
    |--------------------------------------------------------------------------
    */
    'idkind' => array(
        '0' => '本國個人',
        '1' => '事業團體',
        '3' => '國內無地址之外僑',
        '4' => '國內有地址之外僑',
        '5' => '大陸地區個人',
        '6' => '大陸地區法人團體',
        '7' => '非居住者',
        '8' => '境內有分支機構',
        '9' => '境內無分支機構',
    ),

    /*
    |--------------------------------------------------------------------------
    | 程式代碼維護-異動記錄註記
    |--------------------------------------------------------------------------
    */
    'logmk' => array(
        '1' => '記錄',
        '0' => '不記錄',
    ),

    /*
    |--------------------------------------------------------------------------
    | 機關資料-分類
    |--------------------------------------------------------------------------
    */
    'institution_type' => array(
        '1' => '行政院暨所屬機關',
        '2' => '行政院以外中央機關',
        '3' => '直轄市政府暨所屬單位',
        '4' => '縣市政府暨所屬單位',
        '5' => '其他各機關',
    ),

    /*
    |--------------------------------------------------------------------------
    | 薦送機關-層級
    |--------------------------------------------------------------------------
    */
    'recommend_grade' => array(
        '1' => '1',
        '2' => '2',
        '3' => '3',
        '4' => '4',
    ),

    /*
    |--------------------------------------------------------------------------
    | 場地資料-場地類型
    |--------------------------------------------------------------------------
    */
    'place_type' => array(
        '1' => '教室',
        '2' => '會議室',
        '3' => 'KTV',
        '4' => '宿舍',
        '5' => '簡報室',
    ),

    /*
    |--------------------------------------------------------------------------
    | 場地資料-預約類型
    |--------------------------------------------------------------------------
    */
    'place_timetype' => array(
        '1' => '時段',
        '2' => '時間',
    ),

    /*
    |--------------------------------------------------------------------------
    | 場地資料-收費類型
    |--------------------------------------------------------------------------
    */
    'place_feetype' => array(
        '1' => '全年不收費',
        '2' => '全年收費',
        '3' => '週末假日收費',
        '4' => '月場次收費',
        '5' => '年場次收費',
        '6' => 'KTV收費',
    ),

    /*
     |--------------------------------------------------------------------------
     | 場地資料-座位類型
     |--------------------------------------------------------------------------
     */
    'place_seat' => array(
        '1' => '變動座位(30人)',
        '2' => '變動座位(40人)',
        '3' => '固定座位',
    ),

    /*
    |--------------------------------------------------------------------------
    | 場地資料-教室門口
    |--------------------------------------------------------------------------
    */
    'place_door' => array(
        '1' => '右側',
        '2' => '左側',
    ),

    /*
    |--------------------------------------------------------------------------
    | 系統代碼-分類
    |--------------------------------------------------------------------------
    */
    'system_code_type' => array(
        'A' => '資訊課程承辦機構',
        'B' => '講座專長領域',
        'C' => '考核項目',
        'D' => '郵遞區號',
        'E' => '火車費',
        'F' => '收入科目',
        'G' => '統一收據編號',
        'H' => '銀行代碼',
        'I' => '普通收據編號',
        'J' => '職稱代碼',
        'K' => '班別性質',
    ),




    /*
    |--------------------------------------------------------------------------
    | 是或否
    |--------------------------------------------------------------------------
    */
    'yorn' => array(
        'Y' => 'Y',
        'N' => 'N',
    ),

    /*
    |--------------------------------------------------------------------------
    | 上課地點
    |--------------------------------------------------------------------------
    */
    'branch' => array(
        '1' => '臺北院區',
        '2' => '南投院區',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-上課方式
    |--------------------------------------------------------------------------
    */
    'style' => array(
        '1' => '密集式',
        '2' => '分散式(每週一、三、五上課)',
        '3' => '分散式(每週二、四上課)',
        '4' => '其他',
    ),

    /*
    |--------------------------------------------------------------------------
    | 個人帳號-官職等
    |--------------------------------------------------------------------------
    */
    'post' => array(
        '01' => '委任第一職等',
        '02' => '委任第二職等',
        '03' => '委任第三職等',
        '04' => '委任第四職等',
        '05' => '委任第五職等',
        '06' => '薦任第六職等',
        '07' => '薦任第七職等',
        '08' => '薦任第八職等',
        '09' => '薦任第九職等',
        '10' => '簡任第十職等',
        '11' => '簡任第十一職等',
        '12' => '簡任第十二職等',
        '13' => '簡任第十三職等',
        '14' => '簡任第十四職等',
        '15' => '特任',
        '16' => '依法任派人員',
        '17' => '聘雇人員',
        '18' => '約僱人員',
        '19' => '軍職人員',
        '20' => '其他',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-班別類型(new)
    |--------------------------------------------------------------------------
    */
    'classtype' => array(
        '1' => '自辦班',
        '2' => '委訓班',
        '4' => '外地班',
        '5' => '巡迴研習',
        '3' => '合作辦理',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-辦理方式(old)
    |--------------------------------------------------------------------------
    */
    'process' => array(
        '1' => '自行辦理',
        '2' => '委外辦理',
        '3' => '合作辦理',
        '4' => '接受委託',
    ),
    /*
    |--------------------------------------------------------------------------
    | 班別資料-訓練性質
    |--------------------------------------------------------------------------
    */
    'traintype' => array(
        '1' => '中高階公務人員訓練',
        '2' => '人事人員專業訓練',
        '3' => '一般公務人員訓練',
    ),
 
    /*
   |--------------------------------------------------------------------------
   | 班別資料-是否住宿
   |--------------------------------------------------------------------------
   */
    'board' => array(
        '1' => '住宿',
        '2' => '不住宿',
        '3' => '不住宿，但符合條件列外',
    ),
   
    /* (new)
    'board' => array(
        '1' => '因課程需求規定住宿',
        '2' => '不提供住宿',
        '3' => '惟符合條件者得申請',
    ),
    */
    /*
    |--------------------------------------------------------------------------
    | 班別資料-訓期類別
    |--------------------------------------------------------------------------
    */
    'kind' => array(
        '1' => '週',
        '2' => '天',
        '3' => '小時',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-學習性質
    |--------------------------------------------------------------------------
    */
    'classified' => array(
        '1' => '數位',
        '2' => '實體',
        '3' => '混成',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-訓練績效計算方式
    |--------------------------------------------------------------------------
    */
    'cntflag' => array(
        '1' => '由學員名冊計算',
        '2' => '由承辦人員補登',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-報名方式
    |--------------------------------------------------------------------------
    */
    'signin' => array(
        '1' => '年度訓練計畫班期(薦送報名)',
        '2' => '年度臨時增開班期(分配名額)',
        '3' => '開放自由報名班期',
    ),

    
    /*
    |--------------------------------------------------------------------------
    | 班別資料-開放報名對象
    |--------------------------------------------------------------------------
    */
    'registration' => array(
        '1' => '公務人員',
        '2' => '一般民眾',
        '3' => '不限',
    ),
    /*
   |--------------------------------------------------------------------------
   | 班別資料-參訓機關
   |--------------------------------------------------------------------------
   */
    'orgchk' => array(
        '0' => '所有機關',
        '1' => '中央機關',
        '2' => '地方機關',
        '3' => '限定機關',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-機關分區
    |--------------------------------------------------------------------------
    */
    'areachk' => array(
        '1' => '苗栗以北(含花東離島)',
        '2' => '台中以南',
        '3' => '不分區',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-是否是主管班
    |--------------------------------------------------------------------------
    */
    'chfchk' => array(
        '1' => '不限資格',
        '2' => '主管',
        '3' => '非主管',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-是否是人事班
    |--------------------------------------------------------------------------
    */
    'perchk' => array(
        '1' => '不限資格',
        '2' => '人事',
        '3' => '非人事',
    ),

    /*
    |--------------------------------------------------------------------------
    | 性別
    |--------------------------------------------------------------------------
    */
    'sex' => array(
        'M' => '男',
        'F' => '女',
    ),

    /*
    |--------------------------------------------------------------------------
    | 個人帳號-最高學歷
    |--------------------------------------------------------------------------
    */
    'ecode' => array(
        '1' => '博士',
        '2' => '碩士',
        '3' => '學士',
        '4' => '軍警校',
        '5' => '專科',
        '6' => '高中職',
        '7' => '其他',
    ),


    /*
    |--------------------------------------------------------------------------
    | 會議資料-代號
    |--------------------------------------------------------------------------
    */
    'meet' => array(
        'M' => 'M 行政會議',
        'R' => 'R 場地釋放',
        'T' => 'T 訓練業務',
    ),

    /*
    |--------------------------------------------------------------------------
    | 會議資料-代號
    |--------------------------------------------------------------------------
    */
    'news_tw_type' => array(
        '1' => '訓練進修',
        '2' => '游於藝講堂',
        '3' => '行政類',
    ),









    /*
    |--------------------------------------------------------------------------
    | 每頁幾筆下拉選項
    |--------------------------------------------------------------------------
    */
    'paginate_qty' => array(10, 20, 30, 50, 100),

    /*
    |--------------------------------------------------------------------------
    | 後台登入頁面標題
    |--------------------------------------------------------------------------
    */

    'login_title' => '教育訓練管理系統',

    /*
    |--------------------------------------------------------------------------
    | 後台標題
    |--------------------------------------------------------------------------
    */

    'admin_title' => '教育訓練管理系統',

    /*
    |--------------------------------------------------------------------------
    | 左側選單標題
    |--------------------------------------------------------------------------
    */

    'menu_title' => '教育訓練管理系統',

    /*
    |--------------------------------------------------------------------------
    | Email 發件者
    |--------------------------------------------------------------------------
    */

    'email_service_form' => '',

    /*
    |--------------------------------------------------------------------------
    | Email 標題
    |--------------------------------------------------------------------------
    */

    'email_service_subject' => '',

    /*
    |--------------------------------------------------------------------------
    | 上傳圖片容量上限(MB)
    |--------------------------------------------------------------------------
    */

    'upimage_max_size' => 4,

    /*
    |--------------------------------------------------------------------------
    | 上傳檔案容量上限(MB)
    |--------------------------------------------------------------------------
    */

    'upfile_max_size' => 10,

    /*
    |--------------------------------------------------------------------------
    | 允許上傳的檔案副檔名
    |--------------------------------------------------------------------------
    */

    'extension_pass' => [
        'zip',
        'odt',
        'pdf',
//        'rar',
//        'jpg',
//        'jpeg',
//        'png',
//        'gif',
//        'xlsx',
//        'xls',
//        'doc',
//        'docx',
//        'ppt',
//        'pptx',
    ],

    /*
    |--------------------------------------------------------------------------
    | Application Name
    |--------------------------------------------------------------------------
    |
    | This value is the name of your application. This value is used when the
    | framework needs to place the application's name in a notification or
    | any other location as required by the application or its packages.
    */

    'name' => '教育訓練管理系統',

    /*
    |--------------------------------------------------------------------------
    | Application Environment
    |--------------------------------------------------------------------------
    |
    | This value determines the "environment" your application is currently
    | running in. This may determine how you prefer to configure various
    | services your application utilizes. Set this in your ".env" file.
    |
    */

    'env' => env('APP_ENV', 'production'),

    /*
    |--------------------------------------------------------------------------
    | Application Debug Mode
    |--------------------------------------------------------------------------
    |
    | When your application is in debug mode, detailed error messages with
    | stack traces will be shown on every error that occurs within your
    | application. If disabled, a simple generic error page is shown.
    |
    */

    'debug' => env('APP_DEBUG', false),

    /*
    |--------------------------------------------------------------------------
    | Application URL
    |--------------------------------------------------------------------------
    |
    | This URL is used by the console to properly generate URLs when using
    | the Artisan command line tool. You should set this to the root of
    | your application so that it is used when running Artisan tasks.
    |
    */

    'url' => env('APP_URL', 'http://localhost'),

    /*
    |--------------------------------------------------------------------------
    | Application Timezone
    |--------------------------------------------------------------------------
    |
    | Here you may specify the default timezone for your application, which
    | will be used by the PHP date and date-time functions. We have gone
    | ahead and set this to a sensible default for you out of the box.
    |
    */

    'timezone' => 'Asia/Taipei',

    /*
    |--------------------------------------------------------------------------
    | Application Locale Configuration
    |--------------------------------------------------------------------------
    |
    | The application locale determines the default locale that will be used
    | by the translation service provider. You are free to set this value
    | to any of the locales which will be supported by the application.
    |
    */

    'locale' => 'en',

    /*
    |--------------------------------------------------------------------------
    | Application Fallback Locale
    |--------------------------------------------------------------------------
    |
    | The fallback locale determines the locale to use when the current one
    | is not available. You may change the value to correspond to any of
    | the language folders that are provided through your application.
    |
    */

    'fallback_locale' => 'tw',

    /*
    |--------------------------------------------------------------------------
    | Encryption Key
    |--------------------------------------------------------------------------
    |
    | This key is used by the Illuminate encrypter service and should be set
    | to a random, 32 character string, otherwise these encrypted strings
    | will not be safe. Please do this before deploying an application!
    |
    */

    'key' => env('APP_KEY'),

    'cipher' => 'AES-256-CBC',

    /*
    |--------------------------------------------------------------------------
    | Logging Configuration
    |--------------------------------------------------------------------------
    |
    | Here you may configure the log settings for your application. Out of
    | the box, Laravel uses the Monolog PHP logging library. This gives
    | you a variety of powerful log handlers / formatters to utilize.
    |
    | Available Settings: "single", "daily", "syslog", "errorlog"
    |
    */

    'log' => env('APP_LOG', 'single'),

    'log_level' => env('APP_LOG_LEVEL', 'debug'),

    /*
    |--------------------------------------------------------------------------
    | Autoloaded Service Providers
    |--------------------------------------------------------------------------
    |
    | The service providers listed here will be automatically loaded on the
    | request to your application. Feel free to add your own services to
    | this array to grant expanded functionality to your applications.
    |
    */

    'providers' => [

        /*
         * Laravel Framework Service Providers...
         */
        Illuminate\Auth\AuthServiceProvider::class,
        Illuminate\Broadcasting\BroadcastServiceProvider::class,
        Illuminate\Bus\BusServiceProvider::class,
        Illuminate\Cache\CacheServiceProvider::class,
        Illuminate\Foundation\Providers\ConsoleSupportServiceProvider::class,
        Illuminate\Cookie\CookieServiceProvider::class,
        Illuminate\Database\DatabaseServiceProvider::class,
        Illuminate\Encryption\EncryptionServiceProvider::class,
        Illuminate\Filesystem\FilesystemServiceProvider::class,
        Illuminate\Foundation\Providers\FoundationServiceProvider::class,
        Illuminate\Hashing\HashServiceProvider::class,
        Illuminate\Mail\MailServiceProvider::class,
        Illuminate\Notifications\NotificationServiceProvider::class,
        Illuminate\Pagination\PaginationServiceProvider::class,
        Illuminate\Pipeline\PipelineServiceProvider::class,
        Illuminate\Queue\QueueServiceProvider::class,
        Illuminate\Redis\RedisServiceProvider::class,
        Illuminate\Auth\Passwords\PasswordResetServiceProvider::class,
        Illuminate\Session\SessionServiceProvider::class,
        Illuminate\Translation\TranslationServiceProvider::class,
        Illuminate\Validation\ValidationServiceProvider::class,
        Illuminate\View\ViewServiceProvider::class,

        /*
         * Package Service Providers...
         */
        Recca0120\LaravelTracy\LaravelTracyServiceProvider::class,
        //

        /*
         * Application Service Providers...
         */
        App\Providers\AppServiceProvider::class,
        App\Providers\AuthServiceProvider::class,
        // App\Providers\BroadcastServiceProvider::class,
        App\Providers\EventServiceProvider::class,
        App\Providers\RouteServiceProvider::class,

        // Forms & HTML
        Collective\Html\HtmlServiceProvider::class,
        // Excel
        Maatwebsite\Excel\ExcelServiceProvider::class,

    ],

    /*
    |--------------------------------------------------------------------------
    | Class Aliases
    |--------------------------------------------------------------------------
    |
    | This array of class aliases will be registered when this application
    | is started. However, feel free to register as many as you wish as
    | the aliases are "lazy" loaded so they don't hinder performance.
    |
    */

    'aliases' => [

        'App' => Illuminate\Support\Facades\App::class,
        'Artisan' => Illuminate\Support\Facades\Artisan::class,
        'Auth' => Illuminate\Support\Facades\Auth::class,
        'Blade' => Illuminate\Support\Facades\Blade::class,
        'Bus' => Illuminate\Support\Facades\Bus::class,
        'Cache' => Illuminate\Support\Facades\Cache::class,
        'Config' => Illuminate\Support\Facades\Config::class,
        'Cookie' => Illuminate\Support\Facades\Cookie::class,
        'Crypt' => Illuminate\Support\Facades\Crypt::class,
        'DB' => Illuminate\Support\Facades\DB::class,
        'Eloquent' => Illuminate\Database\Eloquent\Model::class,
        'Event' => Illuminate\Support\Facades\Event::class,
        'File' => Illuminate\Support\Facades\File::class,
        'Gate' => Illuminate\Support\Facades\Gate::class,
        'Hash' => Illuminate\Support\Facades\Hash::class,
        'Lang' => Illuminate\Support\Facades\Lang::class,
        'Log' => Illuminate\Support\Facades\Log::class,
        'Mail' => Illuminate\Support\Facades\Mail::class,
        'Notification' => Illuminate\Support\Facades\Notification::class,
        'Password' => Illuminate\Support\Facades\Password::class,
        'Queue' => Illuminate\Support\Facades\Queue::class,
        'Redirect' => Illuminate\Support\Facades\Redirect::class,
        'Redis' => Illuminate\Support\Facades\Redis::class,
        'Request' => Illuminate\Support\Facades\Request::class,
        'Response' => Illuminate\Support\Facades\Response::class,
        'Route' => Illuminate\Support\Facades\Route::class,
        'Schema' => Illuminate\Support\Facades\Schema::class,
        'Session' => Illuminate\Support\Facades\Session::class,
        'Storage' => Illuminate\Support\Facades\Storage::class,
        'URL' => Illuminate\Support\Facades\URL::class,
        'Validator' => Illuminate\Support\Facades\Validator::class,
        'View' => Illuminate\Support\Facades\View::class,

        // Forms & HTML
        'Form' => Collective\Html\FormFacade::class,
        'Html' => Collective\Html\HtmlFacade::class,
        // Excel
        'Excel' => Maatwebsite\Excel\Facades\Excel::class,
    ],

    /*
    |--------------------------------------------------------------------------
    | 開發者debug IP
    |--------------------------------------------------------------------------
    |
    */

    'pass_ip' => [
        '::1',
        '127.0.0.1' ,
        '1.34.127.132',
    ],

    /*
    |--------------------------------------------------------------------------
    | 是否是Demo環境
    |--------------------------------------------------------------------------
    |
    */

    'is_demo' => env('IS_DEMO', false),
];
