<?php

return [

    /*
    |--------------------------------------------------------------------------
    | 縣市
    |--------------------------------------------------------------------------
    */
    'county' => array(
        '1' => '台北市',
        '2' => '基隆市',
        '3' => '新北市',
        '4' => '宜蘭縣',
        '5' => '新竹市',
        '6' => '新竹縣',
        '7' => '桃園市',
        '8' => '苗栗縣',
        '9' => '台中市',
        '10' => '彰化縣',
        '11' => '南投縣',
        '12' => '嘉義市',
        '13' => '嘉義縣',
        '14' => '雲林縣',
        '15' => '台南市',
        '16' => '高雄市',
        '17' => '澎湖縣',
        '18' => '屏東縣',
        '19' => '台東縣',
        '20' => '花蓮縣',
        '21' => '金門縣',
        '22' => '連江縣',
    ),
    'county_text' => array(
        '台北市' => '台北市',
        '基隆市' => '基隆市',
        '新北市' => '新北市',
        '宜蘭縣' => '宜蘭縣',
        '新竹市' => '新竹市',
        '新竹縣' => '新竹縣',
        '桃園市' => '桃園市',
        '苗栗縣' => '苗栗縣',
        '台中市' => '台中市',
        '彰化縣' => '彰化縣',
        '南投縣' => '南投縣',
        '嘉義市' => '嘉義市',
        '嘉義縣' => '嘉義縣',
        '雲林縣' => '雲林縣',
        '台南市' => '台南市',
        '高雄市' => '高雄市',
        '澎湖縣' => '澎湖縣',
        '屏東縣' => '屏東縣',
        '台東縣' => '台東縣',
        '花蓮縣' => '花蓮縣',
        '金門縣' => '金門縣',
        '連江縣' => '連江縣',
    ),    
];
