<?php

return [

    'array' => [],
    /*
    |--------------------------------------------------------------------------
    | 是或否
    |--------------------------------------------------------------------------
    */
    'yesorno' => array(
        '1' => '是',
        '0' => '不是',
    ),

    /*
    |--------------------------------------------------------------------------
    | 狀態
    |--------------------------------------------------------------------------
    */
    'active' => array(
        '1' => '啟用',
        '0' => '停用',
    ),

    /*
    |--------------------------------------------------------------------------
    | 是否上傳班別**
    |--------------------------------------------------------------------------
    */
    'upload1' => array(
        'Y' => '已開班',
        'N' => '未開班',
    ),

    /*
    |--------------------------------------------------------------------------
    | 網頁公告**
    |--------------------------------------------------------------------------
    */
    'publish' => array(
        'Y' => '是',
        'N' => '否',
    ),

    /*
    |--------------------------------------------------------------------------
    | 學員請假處理表單-假別
    |--------------------------------------------------------------------------
    */
    'leave_type' => array(
        '1' => '事假',
        '2' => '病假',
        '3' => '喪假',
        '4' => '請假',
        '5' => '缺課',
    ),
    /*
    |--------------------------------------------------------------------------
    | 早餐及住宿名單處理-選項
    |--------------------------------------------------------------------------
    */
    'stay_list_type' => array(
        '1' => '早餐及住宿',
        '2' => '早餐',
        '3' => '住宿',
    ),
    /*
    |--------------------------------------------------------------------------
    | 機關資料-統計與否
    |--------------------------------------------------------------------------
    */
    'institution_is_statistics' => array(
        '1' => '統計',
        '0' => '不統計',
    ),


    /*
    |--------------------------------------------------------------------------
    | 個人帳號-官職等
    |--------------------------------------------------------------------------
    */
    'recommend_officium' => array(
        '01' => '委任第一職等',
        '02' => '委任第二職等',
        '03' => '委任第三職等',
        '04' => '委任第四職等',
        '05' => '委任第五職等',
        '06' => '薦任第六職等',
        '07' => '薦任第七職等',
        '08' => '薦任第八職等',
        '09' => '薦任第九職等',
        '10' => '簡任第十職等',
        '11' => '簡任第十一職等',
        '12' => '簡任第十二職等',
        '13' => '簡任第十三職等',
        '14' => '簡任第十四職等',
        '15' => '特任',
        '16' => '依法任派人員',
        '17' => '聘雇人員',
        '18' => '約僱人員',
        '19' => '軍職人員',
        '20' => '其他',
    ),
    /*
    |--------------------------------------------------------------------------
    | 縣市別
    |--------------------------------------------------------------------------
    */
    // 'city'=>array(
    //     '01'=>'基隆市',
    //     '02'=>'臺北市',
    //     '03'=>'新竹縣', 03->臺北縣
    //     '04'=>'新竹市', 04->桃園縣
    //     '05'=>'苗栗縣', 05->新竹縣
    //     '06'=>'臺中市', 06->
    //     '07'=>'彰化縣',
    //     '08'=>'南投縣',
    //     '09'=>'雲林縣',
    //     '10'=>'嘉義縣',
    //     '11'=>'嘉義市',
    //     '12'=>'臺南市',
    //     '13'=>'高雄市',
    //     '14'=>'屏東縣',
    //     '15'=>'宜蘭縣',
    //     '16'=>'花蓮縣',
    //     '17'=>'臺東縣',
    //     '18'=>'澎湖縣',
    //     '19'=>'金門縣',
    //     '20'=>'連江縣',
    //     '21'=>'新北市',
    //     '22'=>'桃園市',
    // ),

    'city'=>array(
        '00'=>'中央機關',
        '01'=>'基隆市',
        '02'=>'臺北市',
        '03'=>'臺北縣',
        '04'=>'桃園縣',
        '05'=>'新竹縣',
        '06'=>'新竹市',
        '07'=>'苗栗縣',
        '08'=>'臺中縣',
        '09'=>'臺中市',
        '10'=>'彰化縣',
        '11'=>'南投縣',
        '12'=>'雲林縣',
        '13'=>'嘉義縣',
        '14'=>'嘉義市',
        '15'=>'臺南縣',
        '16'=>'臺南市',
        '17'=>'高雄縣',
        '18'=>'高雄市',
        '19'=>'屏東縣',
        '20'=>'宜蘭縣',
        '21'=>'花蓮縣',
        '22'=>'臺東縣',
        '23'=>'澎湖縣',
        '24'=>'金門縣',
        '25'=>'連江縣',
        '26'=>'新北市',
        '27'=>'桃園市',
        '98'=>'高雄縣2',
        '99'=>'其他'
    ),

    /*
    |--------------------------------------------------------------------------
    | 教學方法處理 107以後 (轉移至DB::method)
    |--------------------------------------------------------------------------
    */
    // 'method_method_new' => array(
    //     'M01' => '案例研討法',
    //     'M02' => '(小組)討論教學法',
    //     'M03' => '視聽教學法',
    //     'M04' => '模擬演練法',
    //     'M05' => '體驗學習法',
    //     'M06' => '個案教學法',
    //     'M07' => '問題導向學習法',
    //     'M08' => '微型教學法',
    //     'M09' => '政經兵棋推演',
    //     'M10' => '世界咖啡館',
    //     'M11' => '團隊定向',
    //     'M12' => '籃中演練法',
    //     'M13' => '行動學習法',
    //     'M14' => '探究教學法',
    //     'M15' => '協同教學法',
    //     'M16' => '政策論辨法',
    //     'M17' => '多元文化教學法',
    //     'M18' => '示範教學法',
    // ),

    /*
    |--------------------------------------------------------------------------
    | 教學方法處理 107以前  (轉移至DB::method)
    |--------------------------------------------------------------------------
    */
    // 'method_method_old' => array(
    //     'M01' => '分組討論/對話法',
    //     'M02' => '問題導向學習法',
    //     'M03' => '個案教學法',
    //     'M04' => '視聽教學法',
    //     'M05' => '示範演練法',
    //     'M06' => '情境模擬法',
    //     'M07' => '體驗學習法',
    //     'M08' => '行動學習法',
    //     'M09' => '微型教學法',
    //     'M10' => '協同教學法',
    //     'M11' => '跨領域教學法',
    // ),

    /*
    |--------------------------------------------------------------------------
    | 講座聘任-類型
    |--------------------------------------------------------------------------
    */
    'site_survey_dept' => array(
        '1' => '政府機關學校或公營事業機構',
        '2' => '民營企業或私立學校',
        '3' => '非營利機構',
        '4' => '其他',
    ),



    /*
    |--------------------------------------------------------------------------
    | 講座聘任-類型
    |--------------------------------------------------------------------------
    */
    'employ_type' => array(
        '1' => '講座',
        '2' => '助理',
        '3' => '其他',
    ),



    /*
    |--------------------------------------------------------------------------
    | 講座資料維護-轉帳帳戶
    |--------------------------------------------------------------------------
    */
    'lecture_transfor' => array(
        '1' => '郵局',
        '2' => '金融機構',
    ),

    /*
    |--------------------------------------------------------------------------
    | 講座資料維護-分類
    |--------------------------------------------------------------------------
    */
    'lecture_kind' => array(
        '1' => '外聘',
        '2' => '總處',
        '3' => '內聘',
        '4' => '其他',
    ),

    /*
    |--------------------------------------------------------------------------
    | 講座資料維護-郵寄
    |--------------------------------------------------------------------------
    */
    'lecture_send' => array(
        '1' => '機關',
        '2' => '住家',
        '3' => '戶籍地',
    ),

    /*
    |--------------------------------------------------------------------------
    | 講座擬聘處理-證號別
    |--------------------------------------------------------------------------
    */
    'idkind' => array(
        '0' => '本國個人',
        '1' => '事業團體',
        '3' => '國內無地址之外僑',
        '4' => '國內有地址之外僑',
        '5' => '大陸地區個人',
        '6' => '大陸地區法人團體',
        '7' => '非居住者',
        '8' => '境內有分支機構',
        '9' => '境內無分支機構',
    ),

    /*
    |--------------------------------------------------------------------------
    | 講座服務參數維護-種類
    |--------------------------------------------------------------------------
    */
    'license_plate_type' => array(
        '1' => '計程車',
        '2' => '公務車',
    ),

    'car_1' => array(
        'Z' => '公務車',
        '1' => '計程車1',
        '2' => '計程車2',
        '3' => '計程車3',
        '4' => '計程車4',
        '5' => '計程車5',
        '6' => '計程車6',
        '7' => '計程車7',
        '8' => '計程車8',
        '9' => '計程車9',
        '10' => '計程車10',
        '11' => '計程車11',
        '12' => '計程車12',
        '13' => '計程車13',
        '14' => '計程車14',
        '15' => '計程車15',
    ),

    'car_A' => array(
        'Z' => '公務車',
        'A' => '計程車A',
        'B' => '計程車B',
        'C' => '計程車C',
        'D' => '計程車D',
        'E' => '計程車E',
        'F' => '計程車F',
        'G' => '計程車G',
        'H' => '計程車H',
        'I' => '計程車I',
        'J' => '計程車J',
        'K' => '計程車K',
        'L' => '計程車L',
        'M' => '計程車M',
        'N' => '計程車N',
        'O' => '計程車O',
    ),

    'county' => array(
        '1' => '臺中市',
        '2' => '彰化縣',
        '5' => '雲林縣',
        '3' => '南投縣',
        '4' => '其他',
    ),

    'school_location' => array(
        '1' => '文教樓',
        '2' => '英士樓',
    ),

    'food_type' => array(
        '0' => '請選擇',
        '1' => '餐廳',
        '2' => '便當',
    ),

    'day_of_week' => array(
        '' => '請選擇',
        '1' => '一',
        '2' => '二',
        '3' => '三',
        '4' => '四',
        '5' => '五',
        '6' => '六',
        '0' => '日'
    ),

    'work_type' => array(
        '' => '請選擇',
        '1' => '開班前',
        '2' => '開班中',
        '3' => '開班後',
    ),

    'deadline' => array(
        '1' => '無期限',
        '2' => '開課前',
        '3' => '結訓後',
    ),

    'class_complete' => array(
        'N' => '尚未結束辦班',
        'Y' => '結束辦班',
    ),

    'job_complete' => array(
        'N' => '未完成',
        'Y' => '已完成',
    ),

    'job' => array(
          'unit' => '維護單元',
          'arrangement_class' => '維護課程',
          'arrangement_upload' => '上傳實施計畫',
          'class_schedule' => '維護課程表',
          'siteedit' => '調整主教室',
          'publishedit' => '網頁公告',
          'teaching_material' => '維護講座課程教材 (無法凍結)',
          'method' => '設定教學教法',
          'funding_edit_type1' => '維護概算資料',
          'funding_edit_type2' => '維護結算資料',
          'signup_edit_type1' => '非委訓班',
          'signup_edit_type2' => '委訓班',
          'importApplyData' => 'CSV匯入報名資料',
          'review_apply' => '審核及維護報名資料',
          'assign' => '維護可報名人數',
          'special_class_fee' => '維護班期費用資料',
          'transfer_training_letter' => '寄送調訓函(無法凍結)',
          'waiting' => '維護講座擬聘資料',
          'lecture' => '維護講座基本資料 (無法凍結)',
          'lecture_upload' => '上傳個資授權書 (無法凍結)',
          'employ' => '維護講座聘任資料',
          'teacher_related' => '維護講座服務資料',
          'teacher_related_url' => '取得講座填寫連結 (無法凍結)',
          'lecture_mail' => '寄送講座聘函(無法凍結)',
          'modify_manage' => '審核換員、補報及取消報名',
          'student_apply' => '匯入名冊、維護報名資料、公告學員名冊',
          'arrange_group' => '編組別',
          'arrange_stno' => '序學號',
          'leave' => '維護請假資料',
          'punch' => '學員刷卡處理 (無法凍結)',
          'student_grade_setting' => '項目比例設定',
          'student_grade_input_grade' => '成績輸入',
          'digital_class_setting' => '設定數位課程',
          'digital_student' => '維護課程完成狀態',
          'trainQuestSetting' => '設定問卷',
          'notice_emai' => '發送問卷連結E-mail給學員 (無法凍結)',
          'effectiveness_survey' => '設定成效問卷',
          'classes_requirements' => '維護辦班需求(確認)',
          'teaching_material_print' => '教材交印資料處理',
          'entryexport' => '匯出時數資料 (無法凍結)',
        ),

    'system_menu' => array(
          'menu-1' => '年度資料處理',
          'classes' => '年度資料處理/班別資料處理',
          'demand_survey' => '年度資料處理/需求調查處理',
          'demand_survey_commissioned' => '年度資料處理/委訓班需求調查',
          'demand_distribution' => '年度資料處理/需求分配處理',
          'periods' => '年度資料處理/開班期數處理',
          'schedule' => '年度資料處理/訓練排程處理',
          'site_manage' => '年度資料處理/洽借場地班期資料處理',
          'site_schedule' => '年度資料處理/洽借場地班期排程處理',
          'restructuring' => '年度資料處理/組織改制對照表維護',
          'performance' => '年度資料處理/訓練績效處理',
          'class_group' => '年度資料處理/重覆參訓檢核群組維護',
          'menu-1-1' => '年度資料處理/報表列印',
          'demand_measure_report' => '年度資料處理/報表列印/需求調查表',
          'demand_quota_report' => '年度資料處理/報表列印/需求名額統計表',
          'studyplan_all' => '年度資料處理/報表列印/研習實施計畫總表',
          'schedule_list'=>'年度資料處理/報表列印/行事表',
          'training_period_list'=>'年度資料處理/報表列印/訓期一覽表',
          'class_distribution'=>'年度資料處理/報表列印/班次分配表',
          'studyplan_distribution_all' => '年度資料處理/報表列印/名額分配總表',
          'studyplan_distribution_detail' => '年度資料處理/報表列印/名額分配明細表',
          'studyplan_quota_all' => '年度資料處理/報表列印/名額彙總表',
          'training_performance' => '年度資料處理/報表列印/訓練績效報表',
          'YearlyChannelController' => '年度資料處理/報表列印/年度流路明細表',
          'each_training_all' => '年度資料處理/報表列印/各類訓練進修研習成果統計彙總表',
          'business_statistics' => '年度資料處理/報表列印/公務統計報表',
          'delegate_class_term_list'=>'年度資料處理/報表列印/接受委訓班期訓期一覽表',
          'delegate_training_request'=>'年度資料處理/報表列印/接受委託辦理訓練需求彙總表',
          'same_assessment' => '年度資料處理/報表列印/共同考核項目報表',
          'menu-2' => '訓練班務',
          'term_process' => '訓練班務/班務流程',
          'arrangement' => '訓練班務/課程配當安排',
          'class_schedule' => '訓練班務/課程表處理',
          'teaching_material' => '訓練班務/講座授課及教材資料登錄',
          'method' => '訓練班務/教學教法處理',
          'funding' => '訓練班務/經費概(結)算處理',
          'fundingUpdateUnitPrice' => '訓練班務/經費概(結)算處理/更新單價',
          'signup' => '訓練班務/線上報名設定',
          'review_apply' => '訓練班務/報名審核處理',
          'special_class_fee' => '訓練班務/委訓班費用處理',
          'web_simulation' => '訓練班務/模擬前台角色',
          'sponsor_agent' => '訓練班務/班期管理代理人員維護',
          'teachlist' => '訓練班務/維護教法調查班別',
          'teachingmethod' => '訓練班務/教學教法資料維護',
          'menu-2-1' => '訓練班務/報表列印',
          'sendtraining_joint' => '訓練班務/報表列印/聯合派訓通知',
          'sendtraining_quota' => '訓練班務/報表列印/名額分配表',
          'transfer_training_letter' => '訓練班務/報表列印/調訓函',
          'changetraining_plan' => '訓練班務/報表列印/實施計畫',
          'changetraining_error' => '訓練班務/報表列印/班期調派訓異常統計表',
          'course_assignment' => '訓練班務/報表列印/課程配當',
          'course_schedule' => '訓練班務/報表列印/課程表',
          'class_daily_report' => '訓練班務/報表列印/班期日報表',
          'class_term_plan' => '訓練班務/報表列印/班期計畫表',
          'lecture_course_list' => '訓練班務/報表列印/講座期間授課課表',
          'classroom_usage_list' => '訓練班務/報表列印/教室使用一覽表',
          'process_timetable' => '訓練班務/報表列印/辦理流程期限表',
          'course_funding' => '訓練班務/報表列印/課程經費概(結)算表',
          'yearly_class_funding' => '訓練班務/報表列印/年度班期費用統計表',
          'delegate_training_cost' => '訓練班務/報表列印/委訓費用明細表',
          'delegate_training_cost_quota' => '訓練班務/報表列印/委訓經費各單位分配額度表',
          'teachway_all' => '訓練班務/報表列印/教學方法運用彙整表',
          'teach_way_statics' => '訓練班務/報表列印/教法運用統計圖表',
          'teach_way_satisfaction' => '訓練班務/報表列印/班別性質教法運用滿意度統計表',
          'teach_way_course_analyze' => '訓練班務/報表列印/課程教學教法數目分析',
          'teach_way_calss_analyze' => '訓練班務/報表列印/班別性質與教法數目分析表',
          'menu-3' => '講師資料',
          'waiting' => '講師資料/講座擬聘處理',
          'lecture' => '講師資料/講座資料登錄',
          'employ' => '講師資料/講座聘任處理',
          'transfer_processing' => '講師資料/鐘點費轉帳處理',
          'tax_processing' => '講師資料/所得稅申報處理',
          'teacher_related' => '講師資料/講座用餐、住宿、派車資料登錄',
          'teacher_reception' => '講師資料/講座接待管理',
          'satisfaction' => '講師資料/課程及講座查詢(滿意度)',
          'parameter_setting' => '講師資料/講座服務參數維護',
          'menu-3-1' => '講師資料/報表列印',
          'lecture_list' => '講師資料/報表列印/講座名單',
          'teacher_information' => '講師資料/報表列印/講師基本資料',
          'lecture_mail' => '講師資料/報表列印/講座聘函',
          'lecture_signature' => '講師資料/報表列印/講師簽名單',
          'lecture_post' => '講師資料/報表列印/講座郵寄名條',
          'yearly_lecture_roster' => '講師資料/報表列印/年度講座名冊錄',
          'menu-3-1-1' => '講師資料/報表列印/講座一覽表',
          'lecture_categories' => '講師資料/報表列印/講座一覽表/各類別',
          'lecture_class' => '講師資料/報表列印/講座一覽表/各班期',
          'lecture_course' => '講師資料/報表列印/講座一覽表/各課程',
          'application_stickynote' => '講師資料/報表列印/申請表及黏存單',
          'lecture_money_detail' => '講師資料/報表列印/講座費用請領清冊',
          'lecture_money_all' => '講師資料/報表列印/講座費用請領總表',
          'yearly_income_all' => '講師資料/報表列印/年度講座所得統計表',
          'yearly_income_detail' => '講師資料/報表列印/年度講座所得明細表',
          'entrusted_save_all' => '講師資料/報表列印/委託郵局代存總表',
          'post_save_slip' => '講師資料/報表列印/郵政存款單',
          'interbank_remittance_form' => '講師資料/報表列印/郵政跨行匯款申請書',
          'interbank_remittance_detail' => '講師資料/報表列印/跨行匯款明細表',
          'hourlyfee_notice' => '講師資料/報表列印/鐘點費入賬通知書',
          'remittance_detail' => '講師資料/報表列印/匯款明細表',
          'lecture_special_need' => '講師資料/報表列印/講座特殊需求一覽表',
          'lecture_reception_list' => '講師資料/報表列印/講座接待一覽表',
          'lecture_pickup_record' => '講師資料/報表列印/接送講座紀錄結算表',
          'lecture_pickup_record_summary' => '講師資料/報表列印/接送講座紀錄結算總表',
          'lecture_bedroom_usage' => '講師資料/報表列印/講座寢室使用情形一覽表',
          'pickup_location_times' => '講師資料/報表列印/接送地點及次數一覽表',
          'thinktank_all' => '講師資料/報表列印/智庫一覽表',
          'menu-4' => '學員資料',
          'student_apply' => '學員資料/學員報名處理',
          'leave' => '學員資料/學員請假處理',
          'student_grade' => '學員資料/成績輸入處理',
          'digital' => '學員資料/數位時數處理',
          'student' => '學員資料/學員資料登錄',
          'site_review' => '學員資料/洽借場地班期選員處理',
          'punch' => '學員資料/學員刷卡處理',
          'signature' => '學員資料/研習證書列印電子章設定',
          'menu-4-1' => '學員資料/報表列印',
          'student_registration' => '學員資料/報表列印/學員報名表',
          'student_list' => '學員資料/報表列印/學員名冊',
          'student_seat_namecard' => '學員資料/報表列印/學員座位名牌卡',
          'student_namecard' => '學員資料/報表列印/學員識別證',
          'student_signin' => '學員資料/報表列印/學員簽到表',
          'student_seat_list' => '學員資料/報表列印/學員座位表',
          'student_seat_list_south' => '學員資料/報表列印/學員座位表(南投院區)',
          'student_leave' => '學員資料/報表列印/學員請假',
          'student_grade_rpt' => '學員資料/報表列印/學員成績',
          'student_address_book' => '學員資料/報表列印/學員通訊錄',
          'student_card_record' => '學員資料/報表列印/學員刷卡紀錄',
          'student_study_certificate' => '學員資料/報表列印/學員研習證書',
          'student_mail_nametape' => '學員資料/報表列印/學員郵寄名條',
          'student_training_record' => '學員資料/報表列印/學員歷次受訓紀錄',
          'menu-4-1-1' => '學員資料/報表列印/人數統計',
          'count_signin' => '學員資料/報表列印/報到人數',
          'count_participate' => '學員資料/報表列印/各機關參訓人數',
          'count_train' => '學員資料/報表列印/訓練人數',
          'count_onjob_train' => '學員資料/報表列印/在職訓練人數',
          'student_registration_comparison' => '學員資料/報表列印/名額分配及需求填報對照表',
          'organ_sid_comparison' => '學員資料/報表列印/學員服務機關與學號對照表',
          'organ_burden_detail' => '學員資料/報表列印/各委託機關經費負擔明細表',
          'organ_address_letter' => '學員資料/報表列印/委託機關地址條及函稿',
          'student_checklist' => '學員資料/報表列印/學員資料檢核表',
          'trainees_promotion_record' => '學員資料/報表列印/培訓學員升遷異動紀錄',
          'menu-5' => '問卷調查',
          'effectiveness_survey' => '問卷調查/成效問卷製作',
          'effectiveness_process' => '問卷調查/成效問卷處理(105)',
          // 'training_survey' => '問卷調查/訓後問卷製作',
          // 'training_process' => '問卷調查/訓後問卷處理',
          'train_quest_setting' => '問卷調查/訓前訓中訓後問卷設定',
          'notice_emai' => '問卷調查/E-Mail線上問卷填答通知',
          'menu-5-1' => '問卷調查/報表列印',
          'training_evaluation_105' => '問卷調查/報表列印/訓練成效評估表(105)',
          'training_result_105' => '問卷調查/報表列印/訓練成效評估結果統計圖表(105)',
          'class_result_105' => '問卷調查/報表列印/年度各班期訓練成效評估統計表(105)',
          'yearly_statistic' => '問卷調查/報表列印/年度講座之滿意度統計表',
          'lecture_satisfactionlist' => '問卷調查/報表列印/講座滿意度一覽表',
          'class_support_comparison' => '問卷調查/報表列印/各班次行政支援成效比較表',
          'participation_reason_statistics' => '問卷調查/報表列印/參訓原因統計',
          'menu-5-1-1' => '問卷調查/報表列印/問卷(102~104)',
          'training_evaluation_102_104' => '問卷調查/報表列印/問卷(102~104)/訓練成效評估表',
          'training_result_104' => '問卷調查/報表列印/問卷(102~104)/訓練成效評估結果統計圖表(104)',
          'training_result_102' => '問卷調查/報表列印/問卷(102~104)/訓練成效評估結果統計圖表(102)',
          'class_result_102_104' => '問卷調查/報表列印/問卷(102~104)/年度各班期訓練成效評估統計表',
          'menu-5-1-2' => '問卷調查/報表列印/問卷(96~101)',
          'training_evaluation_96_101' => '問卷調查/報表列印/問卷(96~101)/訓練成效評估表',
          'training_result_96_101' => '問卷調查/報表列印/問卷(96~101)/訓練成效評估結果統計圖表',
          'class_result_96_101' => '問卷調查/報表列印/問卷(96~101)/年度各班期訓練成效評估統計表',
          'menu-5-1-3' => '問卷調查/報表列印/問卷(93~95)',
          'training_evaluation_93_95' => '問卷調查/報表列印/問卷(93~95)/訓練成效評估表',
          'training_result_93_95' => '問卷調查/報表列印/問卷(93~95)/訓練成效評估結果統計圖表',
          'class_result_93_95' => '問卷調查/報表列印/問卷(93~95)/年度各班期訓練成效評估統計表',
          'menu-5-1-4' => '問卷調查/報表列印/問卷(90~92)',
          'training_evaluation_90_92' => '問卷調查/報表列印/問卷(90~92)/訓練成效評估表',
          'training_result_90_92' => '問卷調查/報表列印/問卷(90~92)/訓練成效評估結果統計圖表',
          'class_result_90_92' => '問卷調查/報表列印/問卷(90~92)/年度各班期訓練成效評估統計表',
          'training_evaluation_all' => '問卷調查/報表列印/訓練成效評估表',
          'training_result_all' => '問卷調查/報表列印/訓練成效評估結果統計圖表',
          'menu-6' => '場地管理',
          'classes_requirements' => '場地管理/辦班需求(確認)處理',
          'session' => '場地管理/會議資料處理',
          'bookplace' => '場地管理/場地預約處理',
          // 'class_control' => '場地管理/控管辦班處理',
          // 'stay_list' => '場地管理/早餐及住宿名單處理',
          // 'site_check' => '場地管理/場地審核處理',
          'webbookplace' => '場地管理/網路預約場地審核處理',
          'space_charges' => '場地管理/場地收費(南投院區)',
          'roomset' => '場地管理/寢室床位安排(南投院區)',
          'StudentRoomQuery' => '場地管理/學員寢室床位查詢',
          'time_setting' => '場地管理/時段設定',
          'place' => '場地管理/場地資料維護',
          'place_nantou' => '場地管理/場地資料維護(南投院區)',
          'nantou_bedroom' => '場地維護/寢室資料維護(南投)',
          'site_survey' => '場地管理/場地問卷處理(101)',
          'site_survey_old' => '場地管理/場地問卷處理(96~100)',
          'menu-6-1' => '場地管理/報表列印',
          'monthly_demand' => '場地管理/報表列印/每月需求表',
          'weekly_confirm' => '場地管理/報表列印/每周確認表',
          'dining_table' => '場地管理/報表列印/用餐人數概況表',
          'menu-6-1-1' => '場地管理/報表列印/每日分配表',
          'daily_distribution_classroom' => '場地管理/報表列印/每日分配表/教室場地',
          'daily_distribution_conference' => '場地管理/報表列印/每日分配表/會議場地',
          'daily_distribution_living' => '場地管理/報表列印/每日分配表/住宿及休閒設施',
          'daily_distribution_dining' => '場地管理/報表列印/每日分配表/用餐數量',
          'menu-6-1-2' => '場地管理/報表列印/管理月報表',
          'manage_monthly_classroom' => '場地管理/報表列印/管理月報表/教室場地',
          'manage_monthly_living' => '場地管理/報表列印/管理月報表/住宿及休閒設施',
          'manage_monthly_dining' => '場地管理/報表列印/管理月報表/用餐數量',
          'manage_monthly_conference' => '場地管理/報表列印/管理月報表/場地使用',
          'site_survey_101' => '場地管理/報表列印/場地問卷與統計表(101)',
          'conference_use_statistics' => '場地管理/報表列印/會議場地使用統計表',
          'monthly_money' => '場地管理/報表列印/各月份費用統計表',
          'dinner_survey' => '場地管理/報表列印/不用晚餐調查表',
          'breakfast_statics' => '場地管理/報表列印/兩週班以上週一用早餐統計表',
          'food_expense_writeoff' => '場地管理/報表列印/伙食費核銷明細表',
          'food_expense_writeoff_summary' => '場地管理/報表列印/伙食費核銷總表',
          'stay_registration' => '場地管理/報表列印/住宿登記概況表',
          'staylist_byfloor' => '場地管理/報表列印/各樓住宿班次人員一覽表',
          'stay_distribution_dutylist' => '場地管理/報表列印/學員住宿分配暨輔導員執勤表',
          'stay_distribution_byclass' => '場地管理/報表列印/學員住宿分配一覽表(分班)',
          'bedroom_distribution' => '場地管理/報表列印/寢室分配情形一覽表',
          'class_status' => '場地管理/報表列印/開辦班次概況表(含住宿)',
          'bedding_laundry_statics' => '場地管理/報表列印/寢具洗滌數量統計表',
          'stay_statics_after_reg' => '場地管理/報表列印/住宿統計表(報到後)',
          'level9_list' => '場地管理/報表列印/薦任9職等主管名單',
          'room_card_box_label' => '場地管理/報表列印/房卡盒標示紙',
          'room_card_receipt' => '場地管理/報表列印/房卡簽收單',
          'loan_bedding_laundry_statics' => '場地管理/報表列印/借住寢室寢具洗滌數量統計表',
          'site_using_list' => '場地管理/報表列印/場地借用行事曆',
          'site_usage_statics' => '場地管理/報表列印/場地使用成效統計表',
          'site_using_maintain_datail' => '場地管理/報表列印/場地借用維護費收入明細統計表',
          'site_application' => '場地管理/報表列印/場地借用申請表',
          'site_using_maintain_all' => '場地管理/報表列印/各場地借用情形及維護費收入統計表',
          'site_using_overview' => '場地管理/報表列印/場地借用概況表',
          'site_survey_96_100' => '場地管理/報表列印/場地問卷與統計表(96~100)',
          'class_dining_living' => '場地管理/報表列印/各班期用餐及住宿統計表',
          'manage_monthly_site' => '場地管理/報表列印/場地使用管理月報表',
          'use_apply_process' => '場地管理/報表列印/填寫領用申請處理',
          'apply_process_query' => '場地管理/報表列印/申請流程查詢作業',
          'use_return_maintainance' => '場地管理/報表列印/領用歸還資料維護',
          'use_happening_list' => '場地管理/報表列印/領用情形一覽表',
          'borrow_return_apply' => '場地管理/報表列印/借用歸還申請',
          'train_dining_living' => '場地管理/報表列印/各訓練班期教室場地用餐及住宿',
          'menu-7' => '教材交印處理',
          'teaching_material_print' => '教材交印處理/教材交印資料處理',
          'teaching_material_statistics' => '教材交印處理/教材印製統計處理',
          'menu-7-1' => '教材交印/報表列印',
          'teaching_material_statistics_rpt' => '教材交印/報表列印/教材交印統計表',
          'teaching_material_form' => '教材交印/報表列印/教材交印單',
          'menu-8' => '例行業務',
          // 'class_material' => '例行業務/班別教材資料處理',
          // 'print' => '例行業務/講座授課及教材資料查詢',
          'menu-8-1' => '例行業務/報表列印',
          'training_organ' => '例行業務/報表列印/訓練機構基本資料表',
          'yearly_teaching_material' => '例行業務/報表列印/年度教材總清冊',
          'class_teaching_material' => '例行業務/報表列印/班別教材一覽表',
          'lecture_teaching_material' => '例行業務/報表列印/講座教材一覽表',
          'course_teaching_material' => '例行業務/報表列印/開班教材清單',
          // 'receipt_inventory' => '例行業務/報表列印/收據清冊',
          'menu-9' => '巡迴研習',
          'itineracy' => '巡迴研習/巡迴研習類別',
          'itineracy_theme' => '巡迴研習/巡迴研習主題',
          'itineracy_unit' => '巡迴研習/巡迴研習單元',
          'itineracy_annual' => '巡迴研習/年度主題設定',
          'itineracy_surveylogin' => '巡迴研習/巡迴研習需求調查登錄',
          'itineracy_schedule' => '巡迴研習/實施日程表',
          'menu-10' => '資料匯出作業',
          'dataexport' => '資料匯出作業/資料匯出處理',
          'entryexport' => '資料匯出作業/入口網站資料匯出',
          'libraryexport' => '資料匯出作業/圖書系統匯出',
          'menu-11' => '進修業務',
          'menu-11-1' => '進修業務/報表列印',
          'people_statistics' => '進修業務/報表列印/人數統計表',
          // 'menu-12' => '網頁維護',
          // 'password_maintenance' => '網頁維護/機關個人密碼維護',
          // 'password_maintenance_user' => '網頁維護/個人密碼維護',
          // 'news_tw' => '網頁維護/中文最新消息維護',
          // 'news_en' => '網頁維護/英文最新消息維護',
          // 'train' => '網頁維護/訓練班期公告',
          // 'site' => '網頁維護/洽借場地班期公告',
          // 'forum' => '網頁維護/人資發展論壇',
          // 'poll' => '網頁維護/網路民調維護',
          'menu-12' => '系統參數',
          'role_simulate' => '系統參數/角色模擬',
          'user_group' => '系統參數/權限群組維護',
          'system_account' => '系統參數/系統帳號維護',
          'program' => '系統參數/異動紀錄設定',
          'program_search' => '系統參數/異動記錄查詢',
          'holiday' => '系統參數/國定假日維護',
          'institution' => '系統參數/機關資料維護',
          'recommend' => '系統參數/薦送機關維護',
          'recommend_user' => '系統參數/機關個人帳號維護',
          'agency' => '系統參數/訓練機構資料維護',
          // 'users' => '系統參數/個人帳號維護',
          'system_code' => '系統參數/系統代碼維護',
          'system_parameter' => '系統參數/系統參數維護',
          'web_portal' => '系統參數/入口網站代碼維護',
          'teaching_material_maintain' => '系統參數/教材交印參數處理',
          'class_process' => '系統參數/班務流程指引維護',
          'reportmg' => '系統參數/重要訊息維護',
          'menu-12-1' => '系統參數/報表列印',
          'change_organ_contact' => '系統參數/報表列印/調訓機關承辦人員聯絡名冊',
          'production_book_system' => '系統參數/報表列印/產製圖書系統用資料',
          // 'ClassCalendarController' => '報表列印/行事表',
          // 'SiteGlanceController' => '報表列印/教室使用一覽表',


        ),

    /*
    |--------------------------------------------------------------------------
    | 程式代碼維護-異動記錄註記
    |--------------------------------------------------------------------------
    */
    'logmk' => array(
        'Y' => '記錄',
        'N' => '不記錄',
    ),

    /*
    |--------------------------------------------------------------------------
    | 機關資料-分類
    |--------------------------------------------------------------------------
    */
    'institution_type' => array(
        '1' => '行政院暨所屬機關',
        '2' => '行政院以外中央機關',
        '3' => '直轄市政府暨所屬單位',
        '4' => '縣市政府暨所屬單位',
        '5' => '其他各機關',
    ),

    /*
    |--------------------------------------------------------------------------
    | 薦送機關-層級
    |--------------------------------------------------------------------------
    */
    'recommend_grade' => array(
        '1' => '1',
        '2' => '2',
        '3' => '3',
        '4' => '4',
    ),

    /*
    |--------------------------------------------------------------------------
    | 場地資料-場地類型
    |--------------------------------------------------------------------------
    */
    'place_type' => array(
        '1' => '教室',
        '2' => '會議室',
        '3' => 'KTV',
        '4' => '宿舍',
        '5' => '簡報室',
    ),

  /*
    |--------------------------------------------------------------------------
    | 調查次數
    |--------------------------------------------------------------------------
    */
    'demand_number' => array(
        '01' => '01',
        '02' => '02',
        '03' => '03',
        '04' => '04',
        '05' => '05',
        '06' => '06',
        '07' => '07',
        '08' => '08',
        '09' => '09',
    ),

    /*
    |--------------------------------------------------------------------------
    | 場地資料-預約類型
    |--------------------------------------------------------------------------
    */
    'place_timetype' => array(
        '1' => '時段',
        '2' => '時間',
    ),

    /*
    |--------------------------------------------------------------------------
    | 場地資料-收費類型
    |--------------------------------------------------------------------------
    */
    'place_feetype' => array(
        '1' => '全年不收費',
        '2' => '全年收費',
        '3' => '週末假日收費',
        '4' => '月場次收費',
        '5' => '年場次收費',
        '6' => 'KTV收費',
    ),

    /*
     |--------------------------------------------------------------------------
     | 場地資料-座位類型
     |--------------------------------------------------------------------------
     */
    'place_seat' => array(
        '1' => '變動座位(30人)',
        '2' => '變動座位(40人)',
        '3' => '固定座位',
    ),

    /*
    |--------------------------------------------------------------------------
    | 場地資料-教室門口
    |--------------------------------------------------------------------------
    */
    'place_door' => array(
        '1' => '右側',
        '2' => '左側',
    ),

    /*
    |--------------------------------------------------------------------------
    | 場地資料-台北福華
    |--------------------------------------------------------------------------
    */
    'no_reservation_area' => array(
        '101'=> '101階梯教室',
        '103'=> '103階梯教室',
        '201'=> '201教室',
        '202'=> '202教室',
        '203'=> '203教室',
        '204'=> '204教室',
        '205'=> '205教室',
        'C01'=> '前瞻廳',
        'C02'=> '卓越堂'
    ),

    /*
    |--------------------------------------------------------------------------
    | 場地預約-回覆處理
    |--------------------------------------------------------------------------
    */
    'replymk' => array(
        // ''  => '未處理',
        '1' => '同意釋出場地使用權',
        '2' => '同意收費租借場地',
        '3' => '同意優惠租借場地',
        '4' => '因時段衝突不釋放',
        '5' => '不符提前釋放原則',
        '6' => '中心預留時段',
        '7' => '人事局預留時段',
    ),


    /*
    |--------------------------------------------------------------------------
    | 系統代碼-分類
    |--------------------------------------------------------------------------
    */
    'system_code_type' => array(
        'A' => '資訊課程承辦機構',
        'B' => '講座專長領域',
        'C' => '考核項目',
        'D' => '郵遞區號',
        'E' => '火車費',
        'F' => '收入科目',
        'G' => '統一收據編號',
        'H' => '銀行代碼',
        'I' => '普通收據編號',
        'J' => '職稱代碼',
        'K' => '班別性質',
        'L' => '類別1-大類',
        'M' => '類別1-次類'
    ),

    'class_type' => array(
        "01" => "政策類",
        "02" => "管理發展類",
        "03" => "人力資源管理類",
        "04" => "人力資源發展類",
        "05" => "法制類",
        "06" => "潛能開發類",
        "07" => "人文省思類",
        "08" => "電腦類",
        "09" => "語文類",
        "10" => "研究所進修類",
        "11" => "專業課程選修類",
        "12" => "其他類",
        "13" => "游於藝講堂",
        "14" => "研習會議",
        "15" => "國際觀類",
        "16" => "身心健康與諮商輔導類",
        "17" => "領導訓練",
        "18" => "管理訓練",
        "19" => "政策性訓練",
        "20" => "人事人員訓練",
        "21" => "專業訓練(含終身學習)",
        "22" => "在職培育訓練",
        "23" => "領導力發展",
        "24" => "政策能力訓練",
        "25" => "部會業務知能訓練",
        "26" => "自我成長及其他"
    ),


    /*
    |--------------------------------------------------------------------------
    | 是或否
    |--------------------------------------------------------------------------
    */
    'yorn' => array(
        'Y' => '聘用',
        'N' => '未遴聘',
        'ALL' => '全部',
    ),

    'yorn2' => array(
        'Y' => '聘用',
        'N' => '未遴聘',
    ),

    /*
    |--------------------------------------------------------------------------
    | 上課地點
    |--------------------------------------------------------------------------
    */
    'branch' => array(
        '1' => '臺北院區',
        '2' => '南投院區',

    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-上課方式
    |--------------------------------------------------------------------------
    */
    'style' => array(
        '1' => '密集式',
        '2' => '分散式(每週一、三、五上課)',
        '3' => '分散式(每週二、四上課)',
        '4' => '其他',
    ),

    /*
    |--------------------------------------------------------------------------
    | 個人帳號-官職等
    |--------------------------------------------------------------------------
    */
    'post' => array(
        '1' => '委任第一職等',
        '2' => '委任第二職等',
        '3' => '委任第三職等',
        '4' => '委任第四職等',
        '5' => '委任第五職等',
        '6' => '薦任第六職等',
        '7' => '薦任第七職等',
        '8' => '薦任第八職等',
        '9' => '薦任第九職等',
        '10' => '簡任第十職等',
        '11' => '簡任第十一職等',
        '12' => '簡任第十二職等',
        '13' => '簡任第十三職等',
        '14' => '簡任第十四職等',
        '15' => '特任',
        '16' => '依法任派人員',
        '17' => '聘雇人員',
        '18' => '約僱人員',
        '19' => '軍職人員',
        '20' => '其他',
    ),

    /*
    |--------------------------------------------------------------------------
    | 官等區分
    |--------------------------------------------------------------------------
    */
    'position_level' => array(
        '1' => '特任',
        '2' => '簡任',
        '3' => '簡任或薦任',
        '4' => '薦任',
        '5' => '薦任或委任',
        '6' => '委任',
        '7' => '一般(不限官等)'
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-班別類型(new)
    |--------------------------------------------------------------------------
    */
    'process' => array(
        '1' => '自辦班',
        '2' => '委訓班',
        '3' => '合作辦理',
        '4' => '外地班',
        '5' => '巡迴研習',

    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-辦理方式(old)
    |--------------------------------------------------------------------------

    'process' => array(
        '1' => '自行辦理',
        '2' => '委外辦理',
        '3' => '合作辦理',
        '4' => '接受委託',
    ),*/
    /*
    |--------------------------------------------------------------------------
    | 班別資料-訓練性質
    |--------------------------------------------------------------------------
    */
    'traintype' => array(
        '1' => '中高階公務人員訓練',
        '2' => '人事人員專業訓練',
        '3' => '一般公務人員訓練',
    ),

    /*
   |--------------------------------------------------------------------------
   | 班別資料-是否住宿
   |--------------------------------------------------------------------------
   */
   /* (old)
    'board' => array(
        '1' => '住宿',
        '2' => '不住宿',
        '3' => '不住宿，但符合條件列外',
    ),
   */

    'board' => array(
        'Y' => '因課程需求，得申請住宿',
        'X' => '不提供住宿',
        'N' => '惟符合條件者得申請',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-訓期類別
    |--------------------------------------------------------------------------
    */
    'kind' => array(
        '1' => '週',
        '2' => '天',
        '3' => '小時',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-學習性質
    |--------------------------------------------------------------------------
    */
    'classified' => array(
        '1' => '數位',
        '2' => '實體',
        '3' => '混成',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-訓練績效計算方式
    |--------------------------------------------------------------------------
    */
    'cntflag' => array(
        '1' => '由學員名冊計算',
        '2' => '由承辦人員補登',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-報名方式
    |--------------------------------------------------------------------------
    */
    'signin' => array(
        '1' => '年度訓練計畫班期',
        '2' => '年度臨時增開班期',
        '3' => '開放自由報名班期',
    ),


    /*
    |--------------------------------------------------------------------------
    | 班別資料-開放報名對象
    |--------------------------------------------------------------------------
    */
    'registration' => array(
        '1' => '公務人員',
        '2' => '一般民眾',
        '3' => '不限',
    ),
    /*
   |--------------------------------------------------------------------------
   | 班別資料-參訓機關
   |--------------------------------------------------------------------------
   */
    'orgchk' => array(
        '0' => '所有機關',
        '1' => '中央機關',
        '2' => '地方機關',
        '3' => '限定機關',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-機關分區
    |--------------------------------------------------------------------------
    */
    'areachk' => array(
        '1' => '苗栗以北(含花東離島)',
        '2' => '臺中以南',
        '3' => '不分區',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-是否是主管班
    |--------------------------------------------------------------------------
    */
    'chfchk' => array(
        '' => '不限資格',
        'Y' => '主管人員',
        'N' => '非主管人員',
    ),

    /*
    |--------------------------------------------------------------------------
    | 班別資料-是否是人事班
    |--------------------------------------------------------------------------
    */
    'perchk' => array(
        '' => '不限資格',
        'Y' => '人事人員',
        'N' => '非人事人員',
    ),

    /*
    |--------------------------------------------------------------------------
    | 印刷方式
    |--------------------------------------------------------------------------
    */
    'print' => array(
        '1' => '單面印刷',
        '2' => '雙面印刷',
    ),

    /*
    |--------------------------------------------------------------------------
    | 課程分類
    |--------------------------------------------------------------------------
    */
    'classtype' => array(
        'A' => '生活知能',
        'B' => '藝術文化',
        'C' => '健康休閒',
        'D' => '領導管理',
        'E' => '人文知能',
        'F' => '知識科技',
        'G' => '專題演講',
    ),

    /*
    |--------------------------------------------------------------------------
    | 性別
    |--------------------------------------------------------------------------
    */
    'sex' => array(
        'M' => '男',
        'F' => '女',
    ),

    /*
    |--------------------------------------------------------------------------
    | 個人帳號-最高學歷
    |--------------------------------------------------------------------------
    */
    'ecode' => array(
        '1' => '博士',
        '2' => '碩士',
        '3' => '學士',
        '4' => '軍警校',
        '5' => '專科',
        '6' => '高中職',
        '7' => '其他',
    ),

    /*
    |--------------------------------------------------------------------------
    | 訓練問卷種類
    |--------------------------------------------------------------------------
    */
    'train_quest_type' => array(
        1 => '訓前問卷',
        2 => '訓中問卷',
        3 => '訓後問卷'
    ),


    /*
    |--------------------------------------------------------------------------
    | 會議資料-代號
    |--------------------------------------------------------------------------
    */
    'meet' => array(
        'M' => 'M 行政會議',
        'R' => 'R 場地釋放',
        'T' => 'T 訓練業務',
    ),

    /*
    |--------------------------------------------------------------------------
    | 會議資料-代號
    |--------------------------------------------------------------------------
    */
    'news_tw_type' => array(
        '1' => '訓練進修',
        '2' => '游於藝講堂',
        '3' => '行政類',
    ),

    /*
    |--------------------------------------------------------------------------
    | 委訓班審核
    |--------------------------------------------------------------------------
    */
    'demand_audit_status' => array(
        '1' => '審核中',
        '2' => '審核通過',
        '3' => '審核不通過',

    ),

    /*
    |--------------------------------------------------------------------------
    | 委訓班教室類型-代號
    |--------------------------------------------------------------------------
    */
    'demand_survey_commissioned_room_type' => array(
        '1' => '電腦教室(40人)(全部時段)',
        '2' => '電腦教室(40人)(部份時段)',
        '3' => '階梯教室(108人)',
        '4' => '國際會議廳(350人)',
        '5' => '其他',
    ),

    /*
    |--------------------------------------------------------------------------
    | 教學教法篩選
    |--------------------------------------------------------------------------
    */
    'filter' => array(
        '1' =>'全部',
        '2' =>'已設定教學教法',
        '3' =>'未設定教學教法'
    ),

    /*
    |--------------------------------------------------------------------------
    | 時段
    |--------------------------------------------------------------------------
    */
    'time' => array(
        'A' =>'早上',
        'B' =>'下午',
        'C' =>'晚間',
        'D' =>'白天(早上、下午)',
        'E' =>'全天(早上、下午、晚間)'
    ),


    /*
    |--------------------------------------------------------------------------
    | 座位方式
    |--------------------------------------------------------------------------
    */
    'seattype' => array(
        'A' =>'標準型',
        'B' =>'馬蹄型',
        'C' =>'Ｔ型',
        'D' =>'菱型',
        'E' =>'其他'
    ),


    /*
    |--------------------------------------------------------------------------
    | 場地使用者
    |--------------------------------------------------------------------------
    */
    'usertype' => array(
        '1' =>'本中心自辦訓練及活動-中心',
        '2' =>'本中心接洽租借給公務機關',
        '3' =>'本中心接洽租借給民間機構',
        '4' =>'會館接洽租借給公務機關',
        '5' =>'會館接洽租借給民間機構',
        '6' =>'本中心自辦訓練及活動-人事局'
    ),


    /*
    |--------------------------------------------------------------------------
    | 師資陣容
    |--------------------------------------------------------------------------
    */
    'lineup' => array(
        '1' =>'單一老師',
        '2' =>'多位老師'
    ),

    /*
    |--------------------------------------------------------------------------
    | 住宿時間
    |--------------------------------------------------------------------------
    */

    'staytime' => array(
        '1' => '早',
        '2' => '中',
        '3' => '晚'
    ),

    /*
    |--------------------------------------------------------------------------
    | 寢室已安排的重新安排?
    |--------------------------------------------------------------------------
    */

    'resetall' => array(
        'N' => '否',
        'Y' => '是'
    ),


    /*
    |--------------------------------------------------------------------------
    | 每頁幾筆下拉選項
    |--------------------------------------------------------------------------
    */
    'paginate_qty' => array(10, 20, 30, 50, 100),

    /*
    |--------------------------------------------------------------------------
    | 後台登入頁面標題
    |--------------------------------------------------------------------------
    */

    'login_title' => '教育訓練管理系統',

    /*
    |--------------------------------------------------------------------------
    | 後台標題
    |--------------------------------------------------------------------------
    */

    'admin_title' => '教育訓練管理系統',

    /*
    |--------------------------------------------------------------------------
    | 左側選單標題
    |--------------------------------------------------------------------------
    */

    'menu_title' => '教育訓練管理系統',

    /*
    |--------------------------------------------------------------------------
    | Email 發件者
    |--------------------------------------------------------------------------
    */

    'email_service_form' => '',

    /*
    |--------------------------------------------------------------------------
    | Email 標題
    |--------------------------------------------------------------------------
    */

    'email_service_subject' => '',

    /*
    |--------------------------------------------------------------------------
    | 上傳圖片容量上限(MB)
    |--------------------------------------------------------------------------
    */

    'upimage_max_size' => 4,

    /*
    |--------------------------------------------------------------------------
    | 上傳檔案容量上限(MB)
    |--------------------------------------------------------------------------
    */

    'upfile_max_size' => 10,

    /*
    |--------------------------------------------------------------------------
    | 允許上傳的檔案副檔名
    |--------------------------------------------------------------------------
    */

    'extension_pass' => [
        'zip',
        'odt',
        'pdf',
//        'rar',
//        'jpg',
//        'jpeg',
//        'png',
//        'gif',
//        'xlsx',
//        'xls',
//        'doc',
//        'docx',
//        'ppt',
//        'pptx',
    ],

    /*
    |--------------------------------------------------------------------------
    | Application Name
    |--------------------------------------------------------------------------
    |
    | This value is the name of your application. This value is used when the
    | framework needs to place the application's name in a notification or
    | any other location as required by the application or its packages.
    */

    'name' => '教育訓練管理系統',

    /*
    |--------------------------------------------------------------------------
    | Application Environment
    |--------------------------------------------------------------------------
    |
    | This value determines the "environment" your application is currently
    | running in. This may determine how you prefer to configure various
    | services your application utilizes. Set this in your ".env" file.
    |
    */

    'env' => env('APP_ENV', 'production'),

    /*
    |--------------------------------------------------------------------------
    | Application Debug Mode
    |--------------------------------------------------------------------------
    |
    | When your application is in debug mode, detailed error messages with
    | stack traces will be shown on every error that occurs within your
    | application. If disabled, a simple generic error page is shown.
    |
    */

    'debug' => env('APP_DEBUG', false),

    /*
    |--------------------------------------------------------------------------
    | Application URL
    |--------------------------------------------------------------------------
    |
    | This URL is used by the console to properly generate URLs when using
    | the Artisan command line tool. You should set this to the root of
    | your application so that it is used when running Artisan tasks.
    |
    */

    'url' => env('APP_URL', 'http://localhost'),

    /*
    |--------------------------------------------------------------------------
    | Application Timezone
    |--------------------------------------------------------------------------
    |
    | Here you may specify the default timezone for your application, which
    | will be used by the PHP date and date-time functions. We have gone
    | ahead and set this to a sensible default for you out of the box.
    |
    */

    'timezone' => 'Asia/Taipei',

    /*
    |--------------------------------------------------------------------------
    | Application Locale Configuration
    |--------------------------------------------------------------------------
    |
    | The application locale determines the default locale that will be used
    | by the translation service provider. You are free to set this value
    | to any of the locales which will be supported by the application.
    |
    */

    'locale' => 'en',

    /*
    |--------------------------------------------------------------------------
    | Application Fallback Locale
    |--------------------------------------------------------------------------
    |
    | The fallback locale determines the locale to use when the current one
    | is not available. You may change the value to correspond to any of
    | the language folders that are provided through your application.
    |
    */

    'fallback_locale' => 'tw',

    /*
    |--------------------------------------------------------------------------
    | Encryption Key
    |--------------------------------------------------------------------------
    |
    | This key is used by the Illuminate encrypter service and should be set
    | to a random, 32 character string, otherwise these encrypted strings
    | will not be safe. Please do this before deploying an application!
    |
    */

    'key' => env('APP_KEY'),

    'cipher' => 'AES-256-CBC',

    /*
    |--------------------------------------------------------------------------
    | Logging Configuration
    |--------------------------------------------------------------------------
    |
    | Here you may configure the log settings for your application. Out of
    | the box, Laravel uses the Monolog PHP logging library. This gives
    | you a variety of powerful log handlers / formatters to utilize.
    |
    | Available Settings: "single", "daily", "syslog", "errorlog"
    |
    */

    'log' => env('APP_LOG', 'single'),

    'log_level' => env('APP_LOG_LEVEL', 'debug'),

    /*
    |--------------------------------------------------------------------------
    | Autoloaded Service Providers
    |--------------------------------------------------------------------------
    |
    | The service providers listed here will be automatically loaded on the
    | request to your application. Feel free to add your own services to
    | this array to grant expanded functionality to your applications.
    |
    */

    'providers' => [

        /*
         * Laravel Framework Service Providers...
         */
        Illuminate\Auth\AuthServiceProvider::class,
        Illuminate\Broadcasting\BroadcastServiceProvider::class,
        Illuminate\Bus\BusServiceProvider::class,
        Illuminate\Cache\CacheServiceProvider::class,
        Illuminate\Foundation\Providers\ConsoleSupportServiceProvider::class,
        Illuminate\Cookie\CookieServiceProvider::class,
        Illuminate\Database\DatabaseServiceProvider::class,
        Illuminate\Encryption\EncryptionServiceProvider::class,
        Illuminate\Filesystem\FilesystemServiceProvider::class,
        Illuminate\Foundation\Providers\FoundationServiceProvider::class,
        Illuminate\Hashing\HashServiceProvider::class,
        Illuminate\Mail\MailServiceProvider::class,
        Illuminate\Notifications\NotificationServiceProvider::class,
        Illuminate\Pagination\PaginationServiceProvider::class,
        Illuminate\Pipeline\PipelineServiceProvider::class,
        Illuminate\Queue\QueueServiceProvider::class,
        Illuminate\Redis\RedisServiceProvider::class,
        Illuminate\Auth\Passwords\PasswordResetServiceProvider::class,
        Illuminate\Session\SessionServiceProvider::class,
        Illuminate\Translation\TranslationServiceProvider::class,
        Illuminate\Validation\ValidationServiceProvider::class,
        Illuminate\View\ViewServiceProvider::class,

        /*
         * Package Service Providers...
         */
        Recca0120\LaravelTracy\LaravelTracyServiceProvider::class,
        //

        /*
         * Application Service Providers...
         */
        App\Providers\AppServiceProvider::class,
        App\Providers\AuthServiceProvider::class,
        // App\Providers\BroadcastServiceProvider::class,
        App\Providers\EventServiceProvider::class,
        App\Providers\RouteServiceProvider::class,

        // Forms & HTML
        Collective\Html\HtmlServiceProvider::class,
        // Excel
        Maatwebsite\Excel\ExcelServiceProvider::class,
        // Eloquent 模型紀錄
        // OwenIt\Auditing\AuditingServiceProvider::class,

    ],

    /*
    |--------------------------------------------------------------------------
    | Class Aliases
    |--------------------------------------------------------------------------
    |
    | This array of class aliases will be registered when this application
    | is started. However, feel free to register as many as you wish as
    | the aliases are "lazy" loaded so they don't hinder performance.
    |
    */

    'aliases' => [

        'App' => Illuminate\Support\Facades\App::class,
        'Artisan' => Illuminate\Support\Facades\Artisan::class,
        'Auth' => Illuminate\Support\Facades\Auth::class,
        'Blade' => Illuminate\Support\Facades\Blade::class,
        'Bus' => Illuminate\Support\Facades\Bus::class,
        'Cache' => Illuminate\Support\Facades\Cache::class,
        'Config' => Illuminate\Support\Facades\Config::class,
        'Cookie' => Illuminate\Support\Facades\Cookie::class,
        'Crypt' => Illuminate\Support\Facades\Crypt::class,
        'DB' => Illuminate\Support\Facades\DB::class,
        'Eloquent' => Illuminate\Database\Eloquent\Model::class,
        'Event' => Illuminate\Support\Facades\Event::class,
        'File' => Illuminate\Support\Facades\File::class,
        'Gate' => Illuminate\Support\Facades\Gate::class,
        'Hash' => Illuminate\Support\Facades\Hash::class,
        'Lang' => Illuminate\Support\Facades\Lang::class,
        'Log' => Illuminate\Support\Facades\Log::class,
        'Mail' => Illuminate\Support\Facades\Mail::class,
        'Notification' => Illuminate\Support\Facades\Notification::class,
        'Password' => Illuminate\Support\Facades\Password::class,
        'Queue' => Illuminate\Support\Facades\Queue::class,
        'Redirect' => Illuminate\Support\Facades\Redirect::class,
        'Redis' => Illuminate\Support\Facades\Redis::class,
        'Request' => Illuminate\Support\Facades\Request::class,
        'Response' => Illuminate\Support\Facades\Response::class,
        'Route' => Illuminate\Support\Facades\Route::class,
        'Schema' => Illuminate\Support\Facades\Schema::class,
        'Session' => Illuminate\Support\Facades\Session::class,
        'Storage' => Illuminate\Support\Facades\Storage::class,
        'URL' => Illuminate\Support\Facades\URL::class,
        'Validator' => Illuminate\Support\Facades\Validator::class,
        'View' => Illuminate\Support\Facades\View::class,

        // Forms & HTML
        'Form' => Collective\Html\FormFacade::class,
        'Html' => Collective\Html\HtmlFacade::class,

        // Excel
        'Excel' => Maatwebsite\Excel\Facades\Excel::class,


    ],

    /*
    |--------------------------------------------------------------------------
    | 開發者debug IP
    |--------------------------------------------------------------------------
    |
    */

    'pass_ip' => [
        '::1',
        '127.0.0.1' ,
        '61.216.24.95',
        '61.216.24.96',
    ],

    /*
    |--------------------------------------------------------------------------
    | 是否是Demo環境
    |--------------------------------------------------------------------------
    |
    */

    'is_demo' => env('IS_DEMO', false),
];
