<?php 
return [
    "m02tb" => [
        'sex' => [
            'M' => '男',
            'F' => '女'
        ],
        'identity' => [
            1 => '公務人員',
            2 => '一般民眾'
        ],    
        'rank' => [
            '01' => '委任第1職等',
            '02' => '委任第2職等',
            '03' => '委任第3職等',
            '04' => '委任第4職等',
            '05' => '委任第5職等',
            '06' => '薦任第6職等',
            '07' => '薦任第7職等',
            '08' => '薦任第8職等',
            '09' => '薦任第9職等',
            '10' => '簡任第10職等',                                                
            '11' => '簡任第11職等', 
            '12' => '簡任第12職等', 
            '13' => '簡任第13職等', 
            '14' => '簡任第14職等', 
            '15' => '特任',
            '16' => '依法任派用人員',
            '17' => '聘僱人員',
            '18' => '約僱人員',
            '19' => '軍職人員',
            '20' => '其他'                                     
        ],
        'ecode' => [
            1 => '博士',
            2 => '碩士',
            3 => '學士',
            4 => '軍警校',
            5 => '專科',
            6 => '高中職',
            7 => '其他',
        ],                    
    ],
    "t01tb" => [
        "process" => [
            '1' => '自辦班',
            '2' => '委訓班',
            '3' => '合作辦理',
            '4' => '外地班',
            '5' => '巡迴研習'
        ],
        "branch" => [
            '1' => '臺北院區',
            '2' => '南投院區'
        ],
        'kind' => [
            1 => '週',
            2 => '天',
            3 => '小時'
        ]
    ],
    "t04tb" => [
        'diploma' => [
            '' => '',
            1 => '本學院',
            2 => '人事總處'
        ],
        'remarkDefault' => [
            "branch" => [
                1 => '一、研習地點：行政院人事行政總處公務人力發展學院（臺北院區）(臺北市新生南路3段30號)。
二、每節上課時間：原則上每節上課50分鐘、休息10分鐘，必要時得由講座視課程需要彈性調整上課及休息時間。
三、連絡電話：
　（一）講座洽課暨學員事務：02-83691399分機8302。
　（二）研習期間學員聯絡專線：02-83691399分機6232。
　{@counselorInfo}',                
                2 => '一、研習地點：行政院人事行政總處公務人力發展學院（南投院區）(南投市光明路一號)。
二、每節上課時間：原則上每節上課50分鐘、休息10分鐘，必要時得由講座視課程需要彈性調整上課及休息時間。
三、連絡電話：049-2332131分機7121，許倩舲小姐{@counselorInfo}。'
            ]
        ]
    ],
    "t27tb" => [
        'sex' => [
            'M' => '男',
            'F' => '女'
        ],
        // 審核狀態
        'prove' => [
            'N' => '未審核',
            'Y' => '已審核',
            'S' => '已匯入'
        ],
        'identity' => [
            1 => '公務人員',
            2 => '一般民眾'
        ],
        'rank' => [
            '01' => '委任第1職等',
            '02' => '委任第2職等',
            '03' => '委任第3職等',
            '04' => '委任第4職等',
            '05' => '委任第5職等',
            '06' => '薦任第6職等',
            '07' => '薦任第7職等',
            '08' => '薦任第8職等',
            '09' => '薦任第9職等',
            '10' => '簡任第10職等',                                                
            '11' => '簡任第11職等', 
            '12' => '簡任第12職等', 
            '13' => '簡任第13職等', 
            '14' => '簡任第14職等', 
            '15' => '特任',
            '16' => '依法任派用人員',
            '17' => '聘僱人員',
            '18' => '約僱人員',
            '19' => '軍職人員',
            '20' => '其他'                                    
        ],
        'ecode' => [
            1 => '博士',
            2 => '碩士',
            3 => '學士',
            4 => '軍警校',
            5 => '專科',
            6 => '高中職',
            7 => '其他',
        ],
        'vegan' => [
            'Y' => '是',
            'N' => '否'
        ]
    ],
    "t13tb" => [
        'identity' => [
            1 => '公務人員',
            2 => '一般民眾'
        ],
        'ecode' => [
            1 => '博士',
            2 => '碩士',
            3 => '學士',
            4 => '軍警校',
            5 => '專科',
            6 => '高中職',
            7 => '其他',
        ], 
        'rank' => [
            '01' => '委任第1職等',
            '02' => '委任第2職等',
            '03' => '委任第3職等',
            '04' => '委任第4職等',
            '05' => '委任第5職等',
            '06' => '薦任第6職等',
            '07' => '薦任第7職等',
            '08' => '薦任第8職等',
            '09' => '薦任第9職等',
            '10' => '簡任第10職等',                                                
            '11' => '簡任第11職等', 
            '12' => '簡任第12職等', 
            '13' => '簡任第13職等', 
            '14' => '簡任第14職等', 
            '15' => '特任',
            '16' => '依法任派用人員',
            '17' => '聘僱人員',
            '18' => '約僱人員',
            '19' => '軍職人員',
            '20' => '其他'                                     
        ],
        'type' => [
            1 => '學員',
            2 => '學員長',
            3 => '副學員長'
        ],
        'status' => [
            1 => '報到',
            2 => '未報到',
            3 => '退訓',
            4 => '停班課'
        ]                      
    ],
    "t14tb" => [
        'type' => [
            1 => '事假',
            2 => '病假',
            3 => '喪假',
            4 => '請假',
            5 => '缺課',
            6 => '停班課'            
        ]
    ],
    "t39tb" => [
        'source' => [
            1 => '網頁',
            2 => 'E-Mail',
            3 => '傳真',
            4 => '其他'
        ],
        'race' => [
            1 => '現職公務人員',
            2 => '退休公務人員',
            3 => '龍坡里里民'
        ],
        'prove' => [
            'N' => '未審核',
            'X' => '不合格',
            'Y' => '合格',
            'S' => '已轉檔',
            'A' => '備取'
        ],
        'ecode' => [
            1 => '博士',
            2 => '碩士',
            3 => '學士',
            4 => '軍警校',
            5 => '專科',
            6 => '高中職',
            7 => '其他',
        ],
        'chk1' => '同日跨班上課',
        'chk2' => '六個月內曾缺席',
        'chk3' => '重複報名相同課程',
        'chk4' => '同時參加其他課程'    
    ],
    "t07tb" => [
        'type' => [
            1 => '概算',
            2 => '結算'
        ]
    ],
    "m14tb" => [
        'branch' => [
            1 => '臺北院區',
            2 => '南投院區',
            3 => '外地班'
        ]
    ],
    "m13tb" => [
        'kind' => [
            'Y' => '是',
            'N' => '否'
        ]
    ],
    "apply_modify_logs" => [
        'type' => [
            '1' => '換員',
            '2' => '補報',
            '3' => '換期',
            '4' => '取消報名'
        ],
        'status' => [
            'Y' => '通過',
            'X' => '不通過',
            'N' => '未審核'
        ]
    ]
        
];
